package com.netcracker.application;

import org.springframework.boot.SpringApplication;
import org.springframework.boot.autoconfigure.SpringBootApplication;

@SpringBootApplication
public class SpringProjectShopApplication {

	public static void main(String[] args) {
		SpringApplication.run(SpringProjectShopApplication.class, args);
	}

	/*
	TODO:
		1. Добавить возможность покупать товар пользователям
		--оформляется order, происходят изменения в базе и ордер добавляется юзеру и админам (если все ок)
		-У клиента в профиле должны быть все его заказы, у админа - вообще все.
	    2. Сделать так, чтобы была проверка данных на правильность везде (невозможность удаления мейкеров с товаром в магазине, проверка униккальности никнейма)
	    3. Сделать читабельный вывод каталога (без лишней инфы + табличка)
	    3.1 Сделать форму для продукции и работать с ней всегда (не забудь про id)
	    3.2 Разобраться с табличками в html + th
	    4. Обработать ошибку при удалении товара из каталога (Добавить к продукту поле is_deleted)
	    5. Сделать так, что при добавлении товара менеджер выбирал мейкера по выпадашке, а не вручную по id.
	    6. Добавить выбор категории для товара при добавлении товара
	    * Просмотреть все методы в сервисах и контроллерах на возможность появления ошибок.
	    * Сделать в поиске выпадашку по категориям
	    * Обработка ошибок. Добавить свои вьюшки для разных ошибок
	    * Фильтр заказов для менеджеров
	 */

}
