package com.netcracker.application;

import org.springframework.boot.SpringApplication;
import org.springframework.boot.autoconfigure.SpringBootApplication;

@SpringBootApplication
public class SpringProjectShopApplication {

	public static void main(String[] args) {
		SpringApplication.run(SpringProjectShopApplication.class, args);
	}

	/*
	TODO:
	    3. Сделать читабельный вывод каталога (без лишней инфы + табличка)
	    3.1 Сделать форму для продукции и работать с ней всегда (не забудь про id)
	    3.2 Разобраться с табличками в html + th
	    3.3 У юзера сделать форму вывода заказа с возможностью посмотреть состав заказа
	    3.4 Табличка у поиска
	    4. Обработать ошибку при удалении товара из каталога (Добавить к продукту поле is_deleted)
	    4.5 Сделать для удаления категории то же, что и для мейкера
	    5. Сделать так, что при добавлении товара менеджер выбирал мейкера по выпадашке, а не вручную по id.
	    6. Добавить выбор категории для товара при добавлении нового товара
	    7. Добавить админам просмотр юзеров (в форме)
	    * Просмотреть все методы в сервисах и контроллерах на возможность появления ошибок.
	    * Сделать в поиске выпадашку по категориям
	    * Обработка ошибок. Добавить свои вьюшки для разных ошибок
	    * Фильтр заказов для менеджеров
	    * Табличка для карта
	 */

}
