package com.netcracker.application;

import org.springframework.boot.SpringApplication;
import org.springframework.boot.autoconfigure.SpringBootApplication;

@SpringBootApplication
public class SpringProjectShopApplication {

	public static void main(String[] args) {
		SpringApplication.run(SpringProjectShopApplication.class, args);
	}

	/*
	TODO:
		3. Добавить возможность покупать товар пользователям
		--оформляется order, происходят изменения в базе и ордер добавляется юзеру и админам (если все ок)
		---заказанные товары удаляются из корзины юзера
		-У клиента в профиле должны быть все его заказы, у админа - вообще все.
		-Чтобы только авторизованный юзер мог нажать на кнопку, надо написать сабмит кнопку и пост маппинг на /catalogue (тут же добавить в корзину)
	    4. Обработка ошибок. Добавить свои вьюшки для разных ошибок
	    6. Сделать так, чтобы была проверка данных на правильность везде (невозможность удаления мейкеров с товаром в магазине и т. д.)
	    7. Сделать в поиске выпадашку по категориям
	    8. Сделать читабельный вывод каталога (без лишней инфы + табличка)
	    9. Всякие ui кнопки добавить
	    10. Просмотреть все методы в сервисах и контроллерах на возможность появления ошибок.
	 */

}
